Repository: so898/XcodePaI
Catalog: XcodePAI/Localizable.xcstrings
Source language: en
Languages: zh_hans

# %@ Completions for %@
source: %1$@ Completions for %2$@
zh_hans: %1$@ %2$@ 语言代码补全

source: A regression in Xcode 26.1.1 (and subsequent releases) prevents the code assistant from displaying previews for code snippets. The solution involves generating a virtual file name for each snippet; this name serves as the preview content within the interface.
zh_hans: Xcode 26.1.1+ 版本有一个 bug 导致 Code Assistant 中的代码片段（Code Snippet）无法在对话框中显示。开启这个功能会给每个代码片段都生成一各对应的文件名，保证对话中代码片段的展示。

source: About
zh_hans: 关于

source: About MCP…
zh_hans: 关于 MCP…

source: About plugin…
zh_hans: 关于插件…

source: About Supported Model Provider…
zh_hans: 关于支持的模型提供商…

source: Accept suggestions with Tab
zh_hans: 使用 Tab 键接受建议

source: Accept: %lld
zh_hans: 接受：%lld

source: Acceptance Count
zh_hans: 接受数

source: Acceptance Rate
zh_hans: 接受率

source: Accessibility Permission
zh_hans: 辅助功能权限

source: Action
zh_hans: 操作

source: Add
zh_hans: 添加

source: Add a custom config
zh_hans: 增加自定义配置

source: Add a MCP service
zh_hans: 增加 MCP 服务

source: Add a Model Provider
zh_hans: 增加模型提供商

source: Add Argument
zh_hans: 增加参数

source: Add config…
zh_hans: 添加配置…

source: Add custom config…
zh_hans: 添加自定义配置…

source: Add Environment Config
zh_hans: 增加环境键值

source: Add Header
zh_hans: 添加请求头

source: Add MCP
zh_hans: 添加 MCP

source: Add MCP service…
zh_hans: 添加 MCP 服务…

source: Add Model Provider…
zh_hans: 添加模型提供商…

source: Add plugin…
zh_hans: 添加插件…

source: Alert
zh_hans: 提示

source: All Models
zh_hans: 全部模型

source: All Providers
zh_hans: 全部提供商

source: Allow suffix
zh_hans: 上报后续代码内容

source: API Key
zh_hans: API 密钥

source: API Key Header
zh_hans: API 请求头

source: Application restart required for language change.
zh_hans: 语言修改将在应用重启后完全生效。

source: Are you sure you want to discard changes in "%@"? This action cannot be undone.
zh_hans: 您确定要放弃在“%@”中所做的更改吗？ 此操作无法撤销。

source: Argument
zh_hans: 参数

# Author: %@ (%@)
source: Author: %1$@ (%2$@)
zh_hans: 作者：%1$@（%2$@）

source: By adding plugins to enhance ChatProxy and code sugestion capabilities, and by modifying parameters to provide more information, the results become more accurate.
zh_hans: 通过添加插件增强 ChatProxy和代码补全能力，修改传参以提供更多信息，使结果更加精确。

source: Cancel
zh_hans: 取消

source: Chat Proxy
zh_hans: 聊天代理

source: Chat URL
zh_hans: 聊天 URL

source: Check
zh_hans: 检查

source: Check Update
zh_hans: 检查更新

source: Checking MCP…
zh_hans: 正在检查 MCP…

source: Chinese
zh_hans: 中文

source: Code Completion Acceptance Rate
zh_hans: 代码补全接受率

source: Code Snippet (Default)
zh_hans: 代码片段（默认）

source: Command
zh_hans: 命令

source: Commit
zh_hans: 提交

source: Commit failed
zh_hans: 提交失败

source: Commit successful!
zh_hans: 提交成功！

source: Completion Accepted: %@
zh_hans: 补全接受：%@

source: Completion Token
zh_hans: 输出 Token

source: Completion Token: %lld
zh_hans: 输出 Token：%lld

source: Completion URL
zh_hans: 补全 URL

source: Completions
zh_hans: 补全

source: Config
zh_hans: 配置

source: Configure Claude Proxy
zh_hans: 配置 Claude 代理

source: Configure Codex Proxy
zh_hans: 配置 Codex 代理

source: Configured
zh_hans: 已配置

source: Configured with other provider
zh_hans: 已配置其他代理

source: Custom Code Suggestion
zh_hans: 自定义代码建议

source: Custom Config
zh_hans: 自定义配置

source: Custom URL
zh_hans: 自定义 URL

source: Date
zh_hans: 日期

source: Delete
zh_hans: 删除

source: Delete Config
zh_hans: 删除配置

source: Delete MCP
zh_hans: 删除 MCP

source: Delete Plugin
zh_hans: 删除插件

source: Delete Provider
zh_hans: 删除提供商

source: Description
zh_hans: 描述

source: Detail
zh_hans: 详情

source: Disable
zh_hans: 禁止

source: Disabled
zh_hans: 已禁用

source: Disabled Language List
zh_hans: 禁用语言列表

source: Disabled Languages
zh_hans: 禁用的语言

source: Display Language
zh_hans: 显示语言

source: Edit config
zh_hans: 编辑配置

source: Empty Disable the language of a file from the XcodePaI menu in the status bar.
zh_hans: 空白 从状态栏的 XcodePaI 菜单中禁用文件的语言。

source: Enable
zh_hans: 启用

source: Enable Think
zh_hans: 启用思考

source: Enabled
zh_hans: 已启用

source: English
zh_hans: 英文

source: Enter API Key
zh_hans: 输入 API 密钥

source: Enter commit message…
zh_hans: 输入提交信息…

source: Enter the information for the config.
zh_hans: 输入配置信息。

source: Enter the information for the MCP.
zh_hans: 输入 MCP 信息。

source: Enter the information for the provider.
zh_hans: 输入提供商信息。

source: Environment Key
zh_hans: 环境键

source: Environment Value
zh_hans: 环境值

source: Error
zh_hans: 错误

source: Exit
zh_hans: 退出

source: Experimental Feature
zh_hans: 实验性功能

source: Extension Permission
zh_hans: 扩展权限

source: Failed to import plugin: %@
zh_hans: 导入插件失败： %@

source: False
zh_hans: 否

source: Fetch Models…
zh_hans: 获取模型…

source: Fix code snippet preview for Xcode 26.1.1 and later
zh_hans: 修正 Xcode 26.1.1+ Code Snippet 预览

source: French
zh_hans: 法文

source: General
zh_hans: 通用

source: Generate Commit Message
zh_hans: 生成提交信息

source: Generate commit message with think
zh_hans: 生成提交信息时使用思考

source: Generate timeout
zh_hans: 生成超时时间

source: Generating…
zh_hans: 生成中…

source: Get suggestions in the middle of code
zh_hans: 行间代码补全

source: Git Commit
zh_hans: Git 提交信息

source: Go to Extensions %1$@ → Xcode Source Editor %2$@ → Enable %3$@ for faster and full-featured code completion.
zh_hans: 前往扩展 %1$@ → Xcode 源代码编辑器 %2$@ → %3$@，启用更快、功能更全的代码补全。

source: Grant Permission
zh_hans: 授予权限

source: Granted
zh_hans: 已授权

source: Header Key
zh_hans: 请求头键

source: Header Key (Optional)
zh_hans: 请求头键（可选）

source: Header Value
zh_hans: 请求头值

source: Identifier
zh_hans: 标识符

source: In reasoning (not displayed)
zh_hans: 在 Reasoning 中（不显示）

source: In Request
zh_hans: 通过请求参数

source: In System Prompt
zh_hans: 通过系统提示词

source: Input New Model Name
zh_hans: 输入新模型名称

source: Input Tokens: %lld
zh_hans: 输入 Token：%lld

source: Integration
zh_hans: 集成

source: Internet hosted model provider
zh_hans: 互联网托管的模型提供商

source: Japanese
zh_hans: 日文

source: Korean
zh_hans: 韩文

source: Link
zh_hans: 链接

source: LLM Model Provider
zh_hans: 大语言模型提供商

source: Local
zh_hans: 本地

source: Local MCP
zh_hans: 本地 MCP

source: Local Server Port
zh_hans: 本地服务器端口

source: Max Token
zh_hans: 最大 Token 数

source: MCP Service Check Fail.
zh_hans: MCP 服务检查失败。

source: Misconfigured
zh_hans: 错误配置

source: Model
zh_hans: 模型

source: Model name
zh_hans: 模型名称

source: Model Name
zh_hans: 模型名称

source: Model name can not be empty.
zh_hans: 模型名称不能为空。

source: Model Provider
zh_hans: 模型提供商

source: Model: %@
zh_hans: 模型：%@

source: Models URL
zh_hans: 模型列表 URL

source: Name
zh_hans: 名称

source: No Data
zh_hans: 无数据

source: No staged files
zh_hans: 无暂存文件

source: Not configured
zh_hans: 未配置

source: Not installed
zh_hans: 未安装

source: OK
zh_hans: 确定

source: Open Claude Folder
zh_hans: 打开 Claude 配置

source: Open Codex Folder
zh_hans: 打开 Codex 配置

source: Open Configuration
zh_hans: 打开配置界面

source: Open Git Commit Window
zh_hans: 打开 Git 提交信息窗口

source: Open Git commit window within status bar menu
zh_hans: 在状态栏菜单中显示 Git 提交信息窗口入口

source: Open List
zh_hans: 打开列表

source: OpenAI format request
zh_hans: OpenAI 请求格式

source: Optimize Commit Message
zh_hans: 优化提交信息

source: Output Tokens: %lld
zh_hans: 输出 Token：%lld

source: Partial Request
zh_hans: 补全格式请求

source: Period
zh_hans: 时间段

source: Please enter commit message
zh_hans: 请输入提交信息

source: Plugin
zh_hans: 插件

source: Prefix Request
zh_hans: 前缀格式请求

source: Prompt Token
zh_hans: 输入 Token

source: Prompt Token: %lld
zh_hans: 输入 Token: %lld

source: Provider
zh_hans: 提供商

source: Provider: %@
zh_hans: 提供商：%@

source: Quick Window
zh_hans: 快捷切换浮窗

source: Rate
zh_hans: 比例

source: Rate: %lld%%
zh_hans: 比例：%lld%%

source: Realtime Suggestion
zh_hans: 实时代码补全

source: Record List
zh_hans: 请求记录

source: Refresh git status
zh_hans: 刷新仓库状态

source: Register
zh_hans: 注册

source: Reload
zh_hans: 重新加载

source: Reload models fail.
zh_hans: 重新加载模型失败。

source: Reload models success.
zh_hans: 重新加载模型成功。

source: Reload models will remove all exist model config.
zh_hans: 重新加载模型将删除所有现有模型配置。

source: Reload tools fail.
zh_hans: 重新加载工具失败。

source: Reload tools success.
zh_hans: 重新加载工具成功。

source: Remote
zh_hans: 远程

source: Remote MCP
zh_hans: 远程 MCP

source: Remove
zh_hans: 移除

source: Request
zh_hans: 请求

source: Response
zh_hans: 回应

source: Response Language
zh_hans: 响应语言

source: Response Reason
zh_hans: 回应原因

source: Restart Server
zh_hans: 重启服务器

source: Russian
zh_hans: 俄文

source: Save
zh_hans: 保存

source: Save custom configurations for your selected model and MCPs, and effortlessly access them in the Xcode Chat window.
zh_hans: 保存你选择的模型和 MCP 的自定义配置，并在 Xcode 聊天窗口中轻松访问它们。

source: Select a file to view diff
zh_hans: 选择文件查看修改

source: Settings
zh_hans: 设置

source: Settings…
zh_hans: 设置…

source: Show Git commit in status bar menu
zh_hans: 在状态栏菜单中展示 Git 提交信息开关

source: Show in status bar icon
zh_hans: 在状态栏图标上展示

source: Show in status bar menu
zh_hans: 在状态栏菜单中显示

source: Show loading when requesting
zh_hans: 请求时展示载入动画

source: Show Think In
zh_hans: 显示思考内容在

source: Some providers support tool use via request parameters.
zh_hans: 部分提供商支持在请求参数中使用工具。

source: Stage
zh_hans: 暂存

source: Stage All
zh_hans: 全部暂存

source: Stage file
zh_hans: 暂存文件

source: Staged Changes
zh_hans: 已暂存修改

source: Startup Actions
zh_hans: 应用启动行为

source: Suggestion debounce time
zh_hans: 代码补全防抖时间

source: Supercharge your Xcode experience with your choice of MCP services. Third-party MCPs will have access to your project files and code.
zh_hans: 通过你选择的 MCP 服务增强 Xcode 体验。第三方 MCP 将有权访问你的项目文件和代码。

source: Supercharge your Xcode experience with your choice of third-party model. Third-party models will have access to your project files and code.
zh_hans: 通过你选择的第三方模型增强 Xcode 体验。第三方模型将有权访问你的项目文件和代码。

source: Support Chat
zh_hans: 对话插件

source: Support Code Suggestion
zh_hans: 代码补全插件

source: System Default
zh_hans: 跟随系统

source: Test
zh_hans: 测试

source: Test Config
zh_hans: 测试配置

source: Test Fail
zh_hans: 测试失败

source: Test Success
zh_hans: 测试成功

source: Testing…
zh_hans: 测试中…

source: Text with EOT Mark
zh_hans: 带 EOT 标记的文本

source: The Quick Window is a floating panel that appears below the text input field in Xcode's code assistant. It allows users to switch the model used by ChatProxy or to enable/disable MCP during an ongoing or new conversation. This feature requires Accessibility permissions.
zh_hans: 快捷切换浮窗是一个展示在 Code Assistant 输入框下方的浮动窗口，这个窗口可以让用户快速切换对话使用的模型和对话时启用的 MCP。这个浮窗需要开启辅助功能权限才可使用。

source: This Month
zh_hans: 本月

source: This switch turns on "chain-of-thought" reasoning, making the model explain its step-by-step thinking before answering — ideal for complex problems.
zh_hans: 开启此功能将激活模型的“思维链”推理，使其在给出最终答案前展示逐步的思考过程——尤其适合处理复杂问题。

source: This Week
zh_hans: 本周

source: Time Period
zh_hans: 时间段

source: Timeout
zh_hans: 超时

source: Timestamp: %@
zh_hans: 时间标：%@

source: To avoid exceeding the model's token limit with irrelevant code from Xcode's full-file search results, this feature intelligently condenses the source code surrounding the search keyword.
zh_hans: 为了防止 Xcode 全文搜索触发模型的 Token 数量限制，这个功能通过裁剪搜索结果中的代码，只保留和搜索关键词相关的内容，节省 Token 消耗。

source: Today
zh_hans: 今天

source: Token Count
zh_hans: Token 数量

source: Token Usage
zh_hans: Token 用量

source: Token Usage Index
zh_hans: Token 用量排名

source: Token Usage Records
zh_hans: Token 使用记录

source: Tool
zh_hans: 工具

source: Tool Use
zh_hans: 使用工具

source: Total
zh_hans: 全部

source: Total Count
zh_hans: 总数量

source: Total Token
zh_hans: 总 Token

source: Total Token: %lld
zh_hans: 总 Token 数：%lld

source: Total: %lld
zh_hans: 总共： %lld

source: True
zh_hans: 是

source: Truncate source code in Xcode search results
zh_hans: 裁剪 Xcode 搜索出的源码内容

source: Unknown
zh_hans: 未知

source: Unstage
zh_hans: 取消暂存

source: Unstage All
zh_hans: 全部取消

source: Unstage file
zh_hans: 取消暂存文件

source: Unstaged Changes
zh_hans: 未暂存修改

source: Update Models
zh_hans: 更新模型

source: Usage
zh_hans: 用量

source: Use Chat
zh_hans: 使用 Chat 接口

source: Use custom model for code suggestion/completion, and effortlessly access them in the Xcode Editor window.
zh_hans: 使用自定义模型进行代码建议/补全，并在 Xcode 编辑器窗口中轻松访问它们。

source: Used Models
zh_hans: 使用模型

source: Xcode Claude Proxy
zh_hans: Xcode 内置 Claude 代理

source: Xcode Codex Proxy
zh_hans: Xcode 内置 Codex 代理

source: Xcode Inspector Debug
zh_hans: Xcode 检查器调试

source: Remove Hallucinated Tool Results
zh_hans: 移除幻觉工具调用结果

source: Filters out fabricated tool call responses generated by the model. Enable this to improve response accuracy by discarding tool results that the model invented rather than actually executed.
zh_hans: 过滤模型生成的虚假工具调用响应。开启此功能可丢弃模型虚构而非实际执行的工具结果，从而提高响应准确性。
